# Brewfile for Kamaete - macOS Developer Setup
# This file defines all the essential CLI tools and GUI applications
# to be installed via Homebrew for a complete development environment.
#
# Usage:
#   brew bundle          # Install everything in this file
#   brew bundle cleanup  # Remove packages not listed in this file

tap "homebrew/bundle"

# CLI Tools
brew "git"
brew "gh"

# GUI Applications (Casks)
cask "docker"
cask "ghostty"
cask "visual-studio-code"
cask "zoom"
cask "notion-calendar"
cask "spotify"
cask "slack"
cask "discord"
cask "1password"
cask "google-chrome"
cask "amphetamine"
cask "rectangle"
cask "raycast"
cask "bartender"
